# St7SetResultFileCombCaseData

Sets the combination data for a combined result case in the specified result file combination.

long St7SetResultFileCombCaseData(long uID, long FileNum, long Pos, long CaseNum,

double Factor)

Input Parameters

uID

Strand7 model file ID.

FileNum

Combination file number.

Pos

Result case in combined file.

Result File Combination

CaseNum

Result case.

Factor

Combination factor.